<template>
    <Header></Header>

    <main class="content">
        <div class="container">
            <div class="row mb-5">
                <div class="col">
                    <h1 class="display-3">Шифрования</h1>

                    <p>
                        <span class="ps-4"></span> – ақпаратты құпиялау, рұқсат
                        етілген тұлғаларға қолжетімді және рұқсат етілмеген
                        адамдардан құпия сақталатын ақпаратты түрлендірудің
                        қайтымды түрі
                    </p>
                </div>
            </div>

            <Encrypt
                name="caesar"
                keyType="number"
                :onEncrypt="caesarEncrypt"
                :onDencrypt="caesarDencrypt"
                class="mb-5"
            >
                <template v-slot:title>Цезарь Шифрі</template>

                <template v-slot:short-description>
                    – ең жеңіл және кеңінен тараған шифр әдісі
                </template>

                <template v-slot:description>
                    Оны Цезарь коды, Цезарь жылжытуы немесе жылжыту шифры деп те
                    атайды. Егер әліпбидегі әрбір әріпке өз санын қойып шықса (0
                    бастап), онда шифрлау мен шифрын анықтауды модульдік
                    арифметиканы қолдана отырып мынадай формуламен табамыз: y =
                    (x + k) mod n, x = (y - k) mod n. мұндағы x — ашық мәтіннің
                    таңбасы, y — шифрланған мәтіннің таңбасы, n — әліпби күші,
                    ал k — кілт. Математикалық тұрғыда Цезарь шифры Афин
                    шифрының өзгертілген түрі болып табылады
                </template>
            </Encrypt>

            <Encrypt
                name="vigenere"
                keyType="text"
                :onEncrypt="videnereEncrypt"
                :onDencrypt="videnereDencrypt"
            >
                <template v-slot:title>Шифр Виженера</template>

                <template v-slot:short-description>
                    - кілт сөзін қолданып, алфавиттік мәтінді поли-алфавиттік
                    шифрлау әдісі
                </template>

                <template v-slot:description>
                    Шифрлау және дешифрлауға арналған Виженер шаршысы, Виженер
                    кестесі. Цезарь шифрында алфавиттің әрбір әрібі бір
                    позициялық орынға жылжиды. Мысалға, Цезарь шифрында ауысым
                    3-ке тең болса A=D, B=E және т.б. Виженер шифры әртүрлі
                    ауысымды Цезарь шифрынан тұрады. Шифрлау үшін Виженер
                    шаршысын қолдануға болады. Латын алфавитіне сүйене отырып
                    жасалған Виженер кестесі 26 таңбадан тұрады, сонымен қатар
                    әрбір жол бірнеше позицияға жылжыған. Яғни бізде 26 әртүрлі
                    Цезарь шифры пайда болады. Кілт сөздің таңбасына орай әрбір
                    шифрлау кезеңіне әртүрлі алфавит қолданылады. Мысалға, ашық
                    мәтін келесідей деп алайық: ATTACKATDAWN Хат жіберіп жатқан
                    адам кілт сөздің ұзындығы мәтін ұзындығына тең болғанша
                    циклді түрде қайталап жазады LEMONLEMONLE Ашық мәтіннің
                    бірінші таңбасы A-L кілтіне сәйкес келеді. Жабық мәтіннің
                    бірінші таңбасы L, Виженер кестесіндегі L жолы мен A
                    қатарының қиылысуында жатыр. Тура осындай жүйеде біз екінші
                    әрібі, Е жолы мен Т қатарының қиылысуында жатыр. Ашық
                    мәтіннің келесі бөлігі осылай шифрланады: Ашық мәтін:
                    ATTACKATDAWN Кілт: LEMONLEMONLE Дешифрлау процесі келесідей
                    жүреді: Кілт таңбаларына келетін жолды Виженер кестесінен
                    табамыз. Жол бойынан жабық мәтінге тән бірінші таңбаны
                    іздейміз. Бірінші таңба тұрған қатар, ашық мәтіннің бірінші
                    әрібіне сәйкес келеді. Келесі әріптерді дешифрлау дәл
                    осындай әдіспен жүреді. Егерде n – алфавиттегі әріптер саны;
                    mj-ашық мәтін әріптері; kj-кілт әріптері болса, Виженер
                    әдісін келесідей формуламен беруге болса: cj=mj+kj (mod n)
                    Дешифрлау: mj=cj-kj (mod n) Компьютерде бұндай операция
                    ASCII кодтарын қосу операциясына сәйкес келеді. Дегенмен де,
                    егер Виженер кестесі циклдік араласудан ғана тұрмаса, оның
                    беріктігі артатындығына нық сенімдімін. Әріп қатар мен жолда
                    бір рет қана кездесетіндей кесте жасау өте қиын. Оны тек
                    электрондық компьютерлік құрылғыларда ғана байқап көрген
                    жоқ. Күнделікті өмірде қолдануда Виженер кестесі ешқандай
                    қиындық көрсетпейді. Ол тек шифрлау мен дешифрлауды
                    жеңілдетеді
                </template>
            </Encrypt>
        </div>
    </main>

    <Footer></Footer>
</template>

<script>
import Header from "@/components/Header.vue";
import Footer from "@/components/Footer.vue";
import Encrypt from "@/components/Encrypt.vue";

import caesarCipherMixin from "@/mixins/caesarCipher";
import vigenereCipherMixin from "@/mixins/vigenereCipher";

export default {
    name: "App",
    components: {
        Header,
        Footer,
        Encrypt,
    },
    methods: {},
    mixins: [caesarCipherMixin, vigenereCipherMixin],
};
</script>

<style>
@import url("~bootstrap/dist/css/bootstrap.css");

main.content {
    padding-top: 100px;
}
</style>
